sercankuslu/astromonty/trunk/Programms/dsPIC33/TCPIP Demo App/device_control.c
#include "stdafx.h"
#include "device_control.h"

#ifdef __C30__
#include "TCPIP Stack/TCPIP.h"
#   define INTERRUPT void __attribute__((__interrupt__,__no_auto_psv__))
//#   define DMAOFFSET(x) (WORD)__builtin_dmaoffset(x)
#endif
#ifdef _WIN32
#   define INTERRUPT void
BYTE _DMA_BASE[1];
#   define DMAOFFSET(x) (unsigned int)&x - (unsigned int)&_DMA_BASE
#   define Nop()
#endif


#ifdef _WIN32
WORD T1CON;
WORD T2CON;
WORD T3CON;
WORD T4CON;
WORD T5CON;
WORD T6CON;
WORD T7CON;
WORD T8CON;
WORD T9CON;

WORD TMR1;
WORD TMR2;
WORD TMR3;
WORD TMR4;
WORD TMR5;
WORD TMR6;
WORD TMR7;
WORD TMR8;
WORD TMR9;

WORD PR1;
WORD PR2;
WORD PR3;
WORD PR4;
WORD PR5;
WORD PR6;
WORD PR7;
WORD PR8;
WORD PR9;

WORD OC1CON;
WORD OC2CON;
WORD OC3CON;
WORD OC4CON;
WORD OC5CON;
WORD OC6CON;
WORD OC7CON;
WORD OC8CON;

WORD OC1R;
WORD OC2R;
WORD OC3R;
WORD OC4R;
WORD OC5R;
WORD OC6R;
WORD OC7R;
WORD OC8R;

WORD OC1RS;
WORD OC2RS;
WORD OC3RS;
WORD OC4RS;
WORD OC5RS;
WORD OC6RS;
WORD OC7RS;
WORD OC8RS;

WORD DMA0CON;
WORD DMA1CON;
WORD DMA2CON;
WORD DMA3CON;
WORD DMA4CON;
WORD DMA5CON;
WORD DMA6CON;
WORD DMA7CON;

WORD DMA0REQ;
WORD DMA1REQ;
WORD DMA2REQ;
WORD DMA3REQ;
WORD DMA4REQ;
WORD DMA5REQ;
WORD DMA6REQ;
WORD DMA7REQ;

WORD DMA0PAD;
WORD DMA1PAD;
WORD DMA2PAD;
WORD DMA3PAD;
WORD DMA4PAD;
WORD DMA5PAD;
WORD DMA6PAD;
WORD DMA7PAD;

WORD DMA0STA;
WORD DMA1STA;
WORD DMA2STA;
WORD DMA3STA;
WORD DMA4STA;
WORD DMA5STA;
WORD DMA6STA;
WORD DMA7STA;

WORD DMA0STB;
WORD DMA1STB;
WORD DMA2STB;
WORD DMA3STB;
WORD DMA4STB;
WORD DMA5STB;
WORD DMA6STB;
WORD DMA7STB;

WORD DMA0CNT;
WORD DMA1CNT;
WORD DMA2CNT;
WORD DMA3CNT;
WORD DMA4CNT;
WORD DMA5CNT;
WORD DMA6CNT;
WORD DMA7CNT;

WORD SPI1BUF;
WORD SPI2BUF;


typedef struct 
{
    __EXTENSION BYTE TRISG0:1;
    __EXTENSION BYTE TRISG1:1;
    __EXTENSION BYTE TRISG2:1;
    __EXTENSION BYTE TRISG3:1;
    __EXTENSION BYTE TRISG4:1;
    __EXTENSION BYTE TRISG5:1;
    __EXTENSION BYTE TRISG6:1;
    __EXTENSION BYTE TRISG7:1;
    __EXTENSION BYTE TRISG8:1;
    __EXTENSION BYTE TRISG9:1;
    __EXTENSION BYTE TRISG10:1;
    __EXTENSION BYTE TRISG11:1;
    __EXTENSION BYTE TRISG12:1;
    __EXTENSION BYTE TRISG13:1;
    __EXTENSION BYTE TRISG14:1;
    __EXTENSION BYTE TRISG15:1;
} _TRISGbits;
typedef struct 
{
    __EXTENSION BYTE TRISF0:1;
    __EXTENSION BYTE TRISF1:1;
    __EXTENSION BYTE TRISF2:1;
    __EXTENSION BYTE TRISF3:1;
    __EXTENSION BYTE TRISF4:1;
    __EXTENSION BYTE TRISF5:1;
    __EXTENSION BYTE TRISF6:1;
    __EXTENSION BYTE TRISF7:1;
    __EXTENSION BYTE TRISF8:1;
    __EXTENSION BYTE TRISF9:1;
    __EXTENSION BYTE TRISF10:1;
    __EXTENSION BYTE TRISF11:1;
    __EXTENSION BYTE TRISF12:1;
    __EXTENSION BYTE TRISF13:1;
    __EXTENSION BYTE TRISF14:1;
    __EXTENSION BYTE TRISF15:1;
} _TRISFbits;
typedef struct 
{
    __EXTENSION BYTE LATG0:1;
    __EXTENSION BYTE LATG1:1;
    __EXTENSION BYTE LATG2:1;
    __EXTENSION BYTE LATG3:1;
    __EXTENSION BYTE LATG4:1;
    __EXTENSION BYTE LATG5:1;
    __EXTENSION BYTE LATG6:1;
    __EXTENSION BYTE LATG7:1;
    __EXTENSION BYTE LATG8:1;
    __EXTENSION BYTE LATG9:1;
    __EXTENSION BYTE LATG10:1;
    __EXTENSION BYTE LATG11:1;
    __EXTENSION BYTE LATG12:1;
    __EXTENSION BYTE LATG13:1;
    __EXTENSION BYTE LATG14:1;
    __EXTENSION BYTE LATG15:1;
} _LATGbits;
typedef struct 
{
    __EXTENSION BYTE LATF0:1;
    __EXTENSION BYTE LATF1:1;
    __EXTENSION BYTE LATF2:1;
    __EXTENSION BYTE LATF3:1;
    __EXTENSION BYTE LATF4:1;
    __EXTENSION BYTE LATF5:1;
    __EXTENSION BYTE LATF6:1;
    __EXTENSION BYTE LATF7:1;
    __EXTENSION BYTE LATF8:1;
    __EXTENSION BYTE LATF9:1;
    __EXTENSION BYTE LATF10:1;
    __EXTENSION BYTE LATF11:1;
    __EXTENSION BYTE LATF12:1;
    __EXTENSION BYTE LATF13:1;
    __EXTENSION BYTE LATF14:1;
    __EXTENSION BYTE LATF15:1;
} _LATFbits;
WORD TRISG;
WORD TRISF;
WORD LATG;
WORD LATF;
_TRISGbits TRISGbits;
_TRISFbits TRISFbits;
_LATGbits LATGbits;
_LATFbits LATFbits;


typedef struct 
{
    __EXTENSION BYTE SPIRBF:1;
    __EXTENSION BYTE SPITBF:1;
    __EXTENSION BYTE b2:4;
    __EXTENSION BYTE SPIROV:1;
    __EXTENSION BYTE b7:6;
    __EXTENSION BYTE SPISIDL:1;
    __EXTENSION BYTE b15:1;
    __EXTENSION BYTE SPIEN:1;
} SPISTATbits;

typedef struct 
{
    __EXTENSION BYTE PPRE:2;
    __EXTENSION BYTE SPRE:3;
    __EXTENSION BYTE MSTEN:1;
    __EXTENSION BYTE CKP:1;
    __EXTENSION BYTE SSEN:1;
    __EXTENSION BYTE CKE:1;
    __EXTENSION BYTE SMP:1;
    __EXTENSION BYTE MODE16:1;
    __EXTENSION BYTE DISSDO:1;
    __EXTENSION BYTE DISSCK:1;
    __EXTENSION BYTE b13:1;    
    __EXTENSION BYTE b14:1;
    __EXTENSION BYTE b15:1;
} SPICON1bits;

WORD SPI1STAT;
WORD SPI2STAT;
WORD SPI1CON1;
WORD SPI2CON1;
WORD SPI1CON2;
WORD SPI2CON2;
SPISTATbits SPI1STATbits;
SPISTATbits SPI2STATbits;
SPICON1bits SPI1CON1bits;
SPICON1bits SPI2CON1bits;

typedef struct 
{
    __EXTENSION BYTE b0:1;
    __EXTENSION BYTE TCS:1;
    __EXTENSION BYTE TSYNC:1;
    __EXTENSION BYTE T32:1;
    __EXTENSION BYTE TCKPS:2;
    __EXTENSION BYTE TGATE:1;
    __EXTENSION BYTE b7:1;
    __EXTENSION BYTE b8:1;
    __EXTENSION BYTE b9:1;
    __EXTENSION BYTE b10:1;
    __EXTENSION BYTE b11:1;
    __EXTENSION BYTE b12:1;
    __EXTENSION BYTE TSIDL:1;
    __EXTENSION BYTE b14:1;
    __EXTENSION BYTE TON:1;
} TIMER_CONbits;

TIMER_CONbits T1CONbits;
TIMER_CONbits T2CONbits;
TIMER_CONbits T3CONbits;
TIMER_CONbits T4CONbits;
TIMER_CONbits T5CONbits;
TIMER_CONbits T6CONbits;
TIMER_CONbits T7CONbits;
TIMER_CONbits T8CONbits;
TIMER_CONbits T9CONbits;
typedef struct 
{
    __EXTENSION BYTE OCM:3;
    __EXTENSION BYTE OCTSEL:1;
    __EXTENSION BYTE OCFLT:1;
    __EXTENSION BYTE b4:8;
    __EXTENSION BYTE OCSIDL:1;
    __EXTENSION BYTE b14:2;
} OC_CONbits;
OC_CONbits OC1CONbits;
OC_CONbits OC2CONbits;
OC_CONbits OC3CONbits;
OC_CONbits OC4CONbits;
OC_CONbits OC5CONbits;
OC_CONbits OC6CONbits;
OC_CONbits OC7CONbits;
OC_CONbits OC8CONbits;

typedef struct 
{
    __EXTENSION BYTE MODE:2;
    __EXTENSION BYTE b2:2;
    __EXTENSION BYTE AMODE:2;
    __EXTENSION BYTE b6:5;
    __EXTENSION BYTE NULLW:1;
    __EXTENSION BYTE HALF:1;
    __EXTENSION BYTE DIR:1;
    __EXTENSION BYTE SIZE:1;
    __EXTENSION BYTE CHEN:1;
} DMA_CONbits;
