sercankuslu/astromonty/trunk/Programms/dsPIC33/TCPIP Demo App/device_control.c
DMA_CONbits DMA0CONbits;
DMA_CONbits DMA1CONbits;
DMA_CONbits DMA2CONbits;
DMA_CONbits DMA3CONbits;
DMA_CONbits DMA4CONbits;
DMA_CONbits DMA5CONbits;
DMA_CONbits DMA6CONbits;
DMA_CONbits DMA7CONbits;

typedef struct 
{
    __EXTENSION BYTE IRQSEL0:1;
    __EXTENSION BYTE IRQSEL1:1;
    __EXTENSION BYTE IRQSEL2:1;
    __EXTENSION BYTE IRQSEL3:1;
    __EXTENSION BYTE IRQSEL4:1;
    __EXTENSION BYTE IRQSEL5:1;
    __EXTENSION BYTE IRQSEL6:1;
    __EXTENSION BYTE b7:8;
    __EXTENSION BYTE FORCE:1;
} DMA_REQbits;

DMA_REQbits DMA0REQbits;
DMA_REQbits DMA1REQbits;
DMA_REQbits DMA2REQbits;
DMA_REQbits DMA3REQbits;
DMA_REQbits DMA4REQbits;
DMA_REQbits DMA5REQbits;
DMA_REQbits DMA6REQbits;
DMA_REQbits DMA7REQbits;

struct 
{
    __EXTENSION BYTE PPST0:1;
    __EXTENSION BYTE PPST1:1;
    __EXTENSION BYTE PPST2:1;
    __EXTENSION BYTE PPST3:1;
    __EXTENSION BYTE PPST4:1;
    __EXTENSION BYTE PPST5:1;
    __EXTENSION BYTE PPST6:1;
    __EXTENSION BYTE PPST7:1;
    __EXTENSION BYTE LSTCH:4;
    __EXTENSION BYTE b12:4;
} DMACS1bits;

struct 
{
    __EXTENSION BYTE INT0IF:1;
    __EXTENSION BYTE IC1IF:1;
    __EXTENSION BYTE OC1IF:1;
    __EXTENSION BYTE T1IF:1;
    __EXTENSION BYTE DMA0IF:1;
    __EXTENSION BYTE IC2IF:1;
    __EXTENSION BYTE OC2IF:1;
    __EXTENSION BYTE T2IF:1;
    __EXTENSION BYTE T3IF:1;
    __EXTENSION BYTE SPI1EIF:1;
    __EXTENSION BYTE SPI1IF:1;
    __EXTENSION BYTE U1RXIF:1;
    __EXTENSION BYTE U1TXIF:1;
    __EXTENSION BYTE AD1IF:1;
    __EXTENSION BYTE DMA1IF:1;
    __EXTENSION BYTE b16:1;
} IFS0bits;
struct 
{
    __EXTENSION BYTE SI2C1IF:1;
    __EXTENSION BYTE MI2C1IF:1;
    __EXTENSION BYTE b2:1;
    __EXTENSION BYTE CNIIF:1;
    __EXTENSION BYTE INT1IF:1;
    __EXTENSION BYTE AD2IF:1;
    __EXTENSION BYTE IC7IF:1;
    __EXTENSION BYTE IC8IF:1;
    __EXTENSION BYTE DMA2IF:1;
    __EXTENSION BYTE OC3IF:1;
    __EXTENSION BYTE OC4IF:1;
    __EXTENSION BYTE T4IF:1;
    __EXTENSION BYTE T5IF:1;
    __EXTENSION BYTE INT2IF:1;
    __EXTENSION BYTE U2RXIF:1;
    __EXTENSION BYTE U2TXIF:1;    
} IFS1bits;
struct 
{
    __EXTENSION BYTE SPI2EIF:1;
    __EXTENSION BYTE SPI2IF:1;
    __EXTENSION BYTE C1RXIF:1;
    __EXTENSION BYTE C1IF:1;
    __EXTENSION BYTE DMA3IF:1;
    __EXTENSION BYTE IC3IF:1;
    __EXTENSION BYTE IC4IF:1;
    __EXTENSION BYTE IC5IF:1;
    __EXTENSION BYTE IC6IF:1;
    __EXTENSION BYTE OC5IF:1;
    __EXTENSION BYTE OC6IF:1;
    __EXTENSION BYTE OC7IF:1;
    __EXTENSION BYTE OC8IF:1;
    __EXTENSION BYTE b13:1;
    __EXTENSION BYTE DMA4IF:1;
    __EXTENSION BYTE T6IF:1;
} IFS2bits;
struct 
{
    __EXTENSION BYTE T7IF:1;
    __EXTENSION BYTE SI2C2IF:1;
    __EXTENSION BYTE MI2C2IF:1;
    __EXTENSION BYTE T8IF:1;
    __EXTENSION BYTE T9IF:1;
    __EXTENSION BYTE INT3IF:1;
    __EXTENSION BYTE INT4IF:1;
    __EXTENSION BYTE C2RXIF:1;
    __EXTENSION BYTE C2IF:1;
    __EXTENSION BYTE b9:1;
    __EXTENSION BYTE b10:1;
    __EXTENSION BYTE DCIEIF:1;
    __EXTENSION BYTE DCIIF:1;
    __EXTENSION BYTE DMA5IF:1;
    __EXTENSION BYTE b14:1;
    __EXTENSION BYTE b15:1;
}IFS3bits;
struct 
{
    __EXTENSION BYTE b0:1;
    __EXTENSION BYTE U1EIF:1;
    __EXTENSION BYTE U2EIF:1;
    __EXTENSION BYTE b3:1;
    __EXTENSION BYTE DMA6IF:1;
    __EXTENSION BYTE DMA7IF:1;
    __EXTENSION BYTE C1TXIF:1;
    __EXTENSION BYTE C2TXIF:1;
    __EXTENSION BYTE b8:1;
    __EXTENSION BYTE b9:1;
    __EXTENSION BYTE b10:1;
    __EXTENSION BYTE b11:1;
    __EXTENSION BYTE b12:1;
    __EXTENSION BYTE b13:1;
    __EXTENSION BYTE b14:1;
    __EXTENSION BYTE b15:1;
}IFS4bits;

struct 
{
    __EXTENSION BYTE INT0IE:1;
    __EXTENSION BYTE IC1IE:1;
    __EXTENSION BYTE OC1IE:1;
    __EXTENSION BYTE T1IE:1;
    __EXTENSION BYTE DMA0IE:1;
    __EXTENSION BYTE IC2IE:1;
    __EXTENSION BYTE OC2IE:1;
    __EXTENSION BYTE T2IE:1;
    __EXTENSION BYTE T3IE:1;
    __EXTENSION BYTE SPI1EIE:1;
    __EXTENSION BYTE SPI1IE:1;
    __EXTENSION BYTE U1RXIE:1;
    __EXTENSION BYTE U1TXIE:1;
    __EXTENSION BYTE AD1IE:1;
    __EXTENSION BYTE DMA1IE:1;
    __EXTENSION BYTE b15:1;
} IEC0bits;
struct 
{
    __EXTENSION BYTE SI2C1IE:1;
    __EXTENSION BYTE MI2C1IE:1;
    __EXTENSION BYTE b2:1;
    __EXTENSION BYTE CNIIE:1;
    __EXTENSION BYTE INT1IE:1;
    __EXTENSION BYTE AD2IE:1;
    __EXTENSION BYTE IC7IE:1;
    __EXTENSION BYTE IC8IE:1;
    __EXTENSION BYTE DMA2IE:1;
    __EXTENSION BYTE OC3IE:1;
    __EXTENSION BYTE OC4IE:1;
    __EXTENSION BYTE T4IE:1;
    __EXTENSION BYTE T5IE:1;
    __EXTENSION BYTE INT2IE:1;
    __EXTENSION BYTE U2RXIE:1;
    __EXTENSION BYTE U2TXIE:1;    
} IEC1bits;
struct 
{
    __EXTENSION BYTE SPI2EIE:1;
    __EXTENSION BYTE SPI2IE:1;
    __EXTENSION BYTE C1RXIE:1;
    __EXTENSION BYTE C1IE:1;
    __EXTENSION BYTE DMA3IE:1;
    __EXTENSION BYTE IC3IE:1;
    __EXTENSION BYTE IC4IE:1;
    __EXTENSION BYTE IC5IE:1;
    __EXTENSION BYTE IC6IE:1;
    __EXTENSION BYTE OC5IE:1;
    __EXTENSION BYTE OC6IE:1;
    __EXTENSION BYTE OC7IE:1;
    __EXTENSION BYTE OC8IE:1;
    __EXTENSION BYTE b13:1;
    __EXTENSION BYTE DMA4IE:1;
    __EXTENSION BYTE T6IE:1;
} IEC2bits;
struct 
{
    __EXTENSION BYTE T7IE:1;
    __EXTENSION BYTE SI2C2IE:1;
    __EXTENSION BYTE MI2C2IE:1;
    __EXTENSION BYTE T8IE:1;
    __EXTENSION BYTE T9IE:1;
    __EXTENSION BYTE INT3IE:1;
    __EXTENSION BYTE INT4IE:1;
    __EXTENSION BYTE C2RXIE:1;
    __EXTENSION BYTE C2IE:1;
    __EXTENSION BYTE b9:1;
    __EXTENSION BYTE b10:1;
    __EXTENSION BYTE DCIEIE:1;
    __EXTENSION BYTE DCIIE:1;
    __EXTENSION BYTE DMA5IE:1;
    __EXTENSION BYTE b14:1;
    __EXTENSION BYTE b15:1;
}IEC3bits;
struct 
{
    __EXTENSION BYTE b0:1;
    __EXTENSION BYTE U1EIE:1;
    __EXTENSION BYTE U2EIE:1;
    __EXTENSION BYTE b3:1;
    __EXTENSION BYTE DMA6IE:1;
    __EXTENSION BYTE DMA7IE:1;
    __EXTENSION BYTE C1TXIE:1;
    __EXTENSION BYTE C2TXIE:1;
    __EXTENSION BYTE b8:1;
    __EXTENSION BYTE b9:1;
    __EXTENSION BYTE b10:1;
    __EXTENSION BYTE b11:1;
    __EXTENSION BYTE b12:1;
    __EXTENSION BYTE b13:1;
    __EXTENSION BYTE b14:1;
    __EXTENSION BYTE b15:1;
}IEC4bits;
struct _IPC0bits
{
    __EXTENSION BYTE INT0IP:3;
    __EXTENSION BYTE b1:1;
    __EXTENSION BYTE IC1IP:3;
    __EXTENSION BYTE b3:1;
    __EXTENSION BYTE OC1IP:3;
    __EXTENSION BYTE b5:1;
    __EXTENSION BYTE T1IP:3;
    __EXTENSION BYTE b7:1;
} IPC0bits;
struct _IPC1bits
{
    __EXTENSION BYTE DMA0IP:3;
    __EXTENSION BYTE b1:1;
    __EXTENSION BYTE IC2IP:3;
    __EXTENSION BYTE b3:1;
    __EXTENSION BYTE OC2IP:3;
    __EXTENSION BYTE b5:1;
    __EXTENSION BYTE T2IP:3;
    __EXTENSION BYTE b7:1;
} IPC1bits;
struct _IPC2bits
{
    __EXTENSION BYTE T3IP:3;
    __EXTENSION BYTE b1:1;
    __EXTENSION BYTE SPI1EIP:3;
    __EXTENSION BYTE b3:1;
    __EXTENSION BYTE SPI1IP:3;
    __EXTENSION BYTE b5:1;
    __EXTENSION BYTE U1RXIP:3;
    __EXTENSION BYTE b7:1;
} IPC2bits;
struct _IPC3bits
{
    __EXTENSION BYTE U1TXIP:3;
    __EXTENSION BYTE b1:1;
    __EXTENSION BYTE AD1IP:3;
    __EXTENSION BYTE b3:1;
    __EXTENSION BYTE DMA1IP:3;
    __EXTENSION BYTE b5:1;
    __EXTENSION BYTE b6:4;
} IPC3bits;
struct _IPC4bits
{
    __EXTENSION BYTE SI2C1IP:3;
    __EXTENSION BYTE b1:1;
    __EXTENSION BYTE MI2C1IP:3;
    __EXTENSION BYTE b3:1;
    __EXTENSION BYTE b5:4;
    __EXTENSION BYTE U1RXIP:3;
    __EXTENSION BYTE b7:1;
} IPC4bits;
struct _IPC5bits
{
    __EXTENSION BYTE INT1IP:3;
    __EXTENSION BYTE b1:1;
    __EXTENSION BYTE AD2IP:3;
    __EXTENSION BYTE b3:1;
    __EXTENSION BYTE IC7IP:3;
    __EXTENSION BYTE b5:1;
    __EXTENSION BYTE IC8IP:3;
    __EXTENSION BYTE b7:1;
} IPC5bits;
struct _IPC6bits
{
    __EXTENSION BYTE DMA2IP:3;
    __EXTENSION BYTE b1:1;
    __EXTENSION BYTE OC3IP:3;
    __EXTENSION BYTE b3:1;
    __EXTENSION BYTE OC4IP:3;
    __EXTENSION BYTE b5:1;
    __EXTENSION BYTE T4IP:3;
    __EXTENSION BYTE b7:1;
} IPC6bits;
struct _IPC7bits
{
    __EXTENSION BYTE T5IP:3;
    __EXTENSION BYTE b1:1;
    __EXTENSION BYTE INT2IP:3;
    __EXTENSION BYTE b3:1;
    __EXTENSION BYTE U2RXIP:3;
    __EXTENSION BYTE b5:1;
    __EXTENSION BYTE U2TXIP:3;
    __EXTENSION BYTE b7:1;
} IPC7bits;
struct _IPC8bits
{
    __EXTENSION BYTE SPI2EIP:3;
    __EXTENSION BYTE b1:1;
    __EXTENSION BYTE SPI2IP:3;
    __EXTENSION BYTE b3:1;
    __EXTENSION BYTE C1RXIP:3;
    __EXTENSION BYTE b5:1;
    __EXTENSION BYTE C1IP:3;
    __EXTENSION BYTE b7:1;
} IPC8bits;
struct _IPC9bits
{
    __EXTENSION BYTE DMA3IP:3;
    __EXTENSION BYTE b1:1;
    __EXTENSION BYTE IC3IP:3;
    __EXTENSION BYTE b3:1;
    __EXTENSION BYTE IC4IP:3;
    __EXTENSION BYTE b5:1;
    __EXTENSION BYTE IC5IP:3;
    __EXTENSION BYTE b7:1;
} IPC9bits;
struct _IPC10bits
{
    __EXTENSION BYTE IC6IP:3;
    __EXTENSION BYTE b1:1;
    __EXTENSION BYTE OC5IP:3;
    __EXTENSION BYTE b3:1;
    __EXTENSION BYTE OC6IP:3;
    __EXTENSION BYTE b5:1;
    __EXTENSION BYTE OC7IP:3;
    __EXTENSION BYTE b7:1;
} IPC10bits;
struct _IPC11bits
{
    __EXTENSION BYTE OC8IP:3;
    __EXTENSION BYTE b1:1;
    __EXTENSION BYTE b2:3;
    __EXTENSION BYTE b3:1;
    __EXTENSION BYTE DMA4IP:3;
    __EXTENSION BYTE b5:1;
    __EXTENSION BYTE T6IP:3;
    __EXTENSION BYTE b7:1;
} IPC11bits;
struct _IPC12bits
{
    __EXTENSION BYTE T7IP:3;
    __EXTENSION BYTE b1:1;
    __EXTENSION BYTE SI2C2IP:3;
    __EXTENSION BYTE b3:1;
    __EXTENSION BYTE MI2C2IP:3;
    __EXTENSION BYTE b5:1;
    __EXTENSION BYTE T8IP:3;
    __EXTENSION BYTE b7:1;
} IPC12bits;
struct _IPC13bits
{
    __EXTENSION BYTE T9IP:3;
    __EXTENSION BYTE b1:1;
    __EXTENSION BYTE INT3IP:3;
    __EXTENSION BYTE b3:1;
    __EXTENSION BYTE INT4IP:3;
    __EXTENSION BYTE b5:1;
    __EXTENSION BYTE C2RXIP:3;
    __EXTENSION BYTE b7:1;
} IPC13bits;
struct _IPC14bits
{
    __EXTENSION BYTE C2IP:3;
    __EXTENSION BYTE b1:1;
    __EXTENSION BYTE b2:3;
    __EXTENSION BYTE b3:1;
    __EXTENSION BYTE b4IP:3;
    __EXTENSION BYTE b5:1;
    __EXTENSION BYTE DCEIIP:3;
    __EXTENSION BYTE b7:1;
} IPC14bits;
struct _IPC15bits
{
    __EXTENSION BYTE DCIIP:3;
    __EXTENSION BYTE b1:1;
    __EXTENSION BYTE DMA5IP:3;
    __EXTENSION BYTE b3:1;
    __EXTENSION BYTE b4:3;
    __EXTENSION BYTE b5:1;
    __EXTENSION BYTE b6:3;
    __EXTENSION BYTE b7:1;
} IPC15bits;
struct _IPC16bits
{
    __EXTENSION BYTE b0:3;
    __EXTENSION BYTE b1:1;
    __EXTENSION BYTE U1EIP:3;
    __EXTENSION BYTE b3:1;
    __EXTENSION BYTE U2EIP:3;
    __EXTENSION BYTE b5:1;
    __EXTENSION BYTE b6:3;
    __EXTENSION BYTE b7:1;
} IPC16bits;
struct _IPC17bits
{
    __EXTENSION BYTE DMA6IP:3;
    __EXTENSION BYTE b1:1;
    __EXTENSION BYTE DMA7IP:3;
    __EXTENSION BYTE b3:1;
    __EXTENSION BYTE C1TXIP:3;
    __EXTENSION BYTE b5:1;
    __EXTENSION BYTE C2TXIP:3;
    __EXTENSION BYTE b7:1;
} IPC17bits;

struct _SRbits
    {
    __EXTENSION BYTE C:1;
    __EXTENSION BYTE Z:1;
    __EXTENSION BYTE OV:1;
    __EXTENSION BYTE N:1;
    __EXTENSION BYTE RA:1;
    __EXTENSION BYTE IPL:3;

    __EXTENSION BYTE DC:1;
    __EXTENSION BYTE DA:1;
    __EXTENSION BYTE SAB:1;
    __EXTENSION BYTE OAB:1;
    __EXTENSION BYTE SB:1;
    __EXTENSION BYTE SA:1;
    __EXTENSION BYTE OB:1;
    __EXTENSION BYTE OA:1;
    } SRbits;
#endif //_WIN32


/************************************************************************************************
                                 |========| ==== ==\     /== =======| ======\
                                 ||  ||  ||  ||   ||\   /||   ||   ||  ||   ||
                                     ||      ||   ||\\ //||   || |     ||   ||
                                     ||      ||   || \V/ ||   ||=|     ||===<
                                     ||      ||   ||  V  ||   || |     ||   \\
                                     ||      ||   ||     ||   ||   ||  ||   ||
                                    ====    ==== ====   ==== =======| ==|   \==
************************************************************************************************/
TMRConfigType TMRConfig[9];
//------------------------------------------------------------------------------------------------
int TimerInit(TIMERS_ID id, TMR_CLOCK_SOURCE source, TMR_GATED_MODE gated, TMR_PRESCALER pre, SYS_IDLE idle, TMR_BIT_MODE bit, TMR1_SYNC sync)
//------------------------------------------------------------------------------------------------
{
    WORD Config = 0;
    Config |= ((WORD)idle)   << 13;
    Config |= ((WORD)gated)  << 6;
    Config |= ((WORD)pre)    << 4;
    Config |= ((WORD)bit)    << 3;
    Config |= ((WORD)sync)   << 2;
    Config |= ((WORD)source) << 1;

    switch(id){
        case TIMER1: T1CON = Config;
            break;
        case TIMER2: T2CON = Config;
            break;
        case TIMER3: T3CON = Config;
            break;
        case TIMER4: T4CON = Config;
            break;
        case TIMER5: T5CON = Config;
            break;
        case TIMER6: T6CON = Config;
            break;
        case TIMER7: T7CON = Config;
            break;
        case TIMER8: T8CON = Config;
            break;
        case TIMER9: T9CON = Config;
            break;
        default:
        return -1;
    }
    return 0;
}
//------------------------------------------------------------------------------------------------
int TimerSetInt(TIMERS_ID id, BYTE Level, BOOL enabled)
//------------------------------------------------------------------------------------------------
{
    switch(id){
        case TIMER1:
            IPC0bits.T1IP = Level & 0x07;     // Set Timer1 Interrupt Priority Level
            IFS0bits.T1IF = 0;         // Clear Timer1 Interrupt Flag
            IEC0bits.T1IE = enabled;   // Enable Timer1 interrupt
            break;
        case TIMER2:
            IPC1bits.T2IP = Level & 0x07;     // Set Timer2 Interrupt Priority Level
            IFS0bits.T2IF = 0;         // Clear Timer2 Interrupt Flag
            IEC0bits.T2IE = enabled;   // Enable Timer2 interrupt
            break;
        case TIMER3:
            IPC2bits.T3IP = Level & 0x07;     // Set Timer3 Interrupt Priority Level
            IFS0bits.T3IF = 0;         // Clear Timer3 Interrupt Flag
            IEC0bits.T3IE = enabled;   // Enable Timer3 interrupt
            break;
        case TIMER4:
            IPC6bits.T4IP = Level & 0x07;     // Set Timer4 Interrupt Priority Level
            IFS1bits.T4IF = 0;         // Clear Timer4 Interrupt Flag
            IEC1bits.T4IE = enabled;   // Enable Timer4 interrupt
            break;
        case TIMER5:
            IPC7bits.T5IP = Level & 0x07;     // Set Timer5 Interrupt Priority Level
            IFS1bits.T5IF = 0;         // Clear Timer5 Interrupt Flag
            IEC1bits.T5IE = enabled;   // Enable Timer5 interrupt
            break;
        case TIMER6:
            IPC11bits.T6IP = Level & 0x07;     // Set Timer6 Interrupt Priority Level
            IFS2bits.T6IF = 0;         // Clear Timer6 Interrupt Flag
            IEC2bits.T6IE = enabled;   // Enable Timer6 interrupt
            break;
        case TIMER7:
            IPC12bits.T7IP = Level & 0x07;     // Set Timer7 Interrupt Priority Level
            IFS3bits.T7IF = 0;         // Clear Timer7 Interrupt Flag
            IEC3bits.T7IE = enabled;   // Enable Timer7 interrupt
            break;
        case TIMER8:
            IPC12bits.T8IP = Level & 0x07;     // Set Timer8 Interrupt Priority Level
            IFS3bits.T8IF = 0;         // Clear Timer8 Interrupt Flag
            IEC3bits.T8IE = enabled;   // Enable Timer8 interrupt
            break;
        case TIMER9:
            IPC13bits.T9IP = Level & 0x07;     // Set Timer9 Interrupt Priority Level
            IFS3bits.T9IF = 0;         // Clear Timer9 Interrupt Flag
            IEC3bits.T9IE = enabled;   // Enable Timer9 interrupt
            break;
        default:
        return -1;
    }
    return 0;
}
//------------------------------------------------------------------------------------------------
int TimerSetValue(TIMERS_ID id, WORD TmrValue, WORD PRValue)
//------------------------------------------------------------------------------------------------
{
    switch(id){
        case TIMER1:
            TMR1 = TmrValue;
            PR1  = PRValue;
            break;
        case TIMER2:
            TMR2 = TmrValue;
            PR2  = PRValue;
            break;
        case TIMER3:
            TMR3 = TmrValue;
            PR3  = PRValue;
            break;
        case TIMER4:
            TMR4 = TmrValue;
            PR4  = PRValue;
            break;
        case TIMER5:
            TMR5 = TmrValue;
            PR5  = PRValue;
            break;
        case TIMER6:
            TMR6 = TmrValue;
            PR6  = PRValue;
            break;
        case TIMER7:
            TMR7 = TmrValue;
            PR7  = PRValue;
            break;
        case TIMER8:
            TMR8 = TmrValue;
            PR8  = PRValue;
            break;
        case TIMER9:
            TMR9 = TmrValue;
            PR9  = PRValue;
            break;
        default:
        return -1;
    }
    return 0;
}
//------------------------------------------------------------------------------------------------
void TimerSetState(TIMERS_ID id, BOOL enabled)
//------------------------------------------------------------------------------------------------
{
    switch(id){
        case TIMER1: T1CONbits.TON = enabled;
            break;
        case TIMER2: T2CONbits.TON = enabled;
            break;
        case TIMER3: T3CONbits.TON = enabled;
            break;
        case TIMER4: T4CONbits.TON = enabled;
            break;
        case TIMER5: T5CONbits.TON = enabled;
            break;
        case TIMER6: T6CONbits.TON = enabled;
            break;
        case TIMER7: T7CONbits.TON = enabled;
            break;
        case TIMER8: T8CONbits.TON = enabled;
            break;
        case TIMER9: T9CONbits.TON = enabled;
            break;        
    }
}
//------------------------------------------------------------------------------------------------
int TimerSetCallback(TIMERS_ID id, int (*CallbackFunc)(void))
//------------------------------------------------------------------------------------------------
{
    TMRConfig[id].CallbackFunc = CallbackFunc;
    return 0;
}
/*
//------------------------------------------------------------------------------------------------
INTERRUPT _T1Interrupt( void )
//------------------------------------------------------------------------------------------------
{
    int id = TIMER1;
    if(TMRConfig[id].CallbackFunc){
        TMRConfig[id].CallbackFunc();
    }
    IFS0bits.T1IF = 0; // Clear TIMER1 interrupt flag
}
*/
//------------------------------------------------------------------------------------------------
INTERRUPT _T2Interrupt( void )
//------------------------------------------------------------------------------------------------
{
    int id = TIMER2;
    if(TMRConfig[id].CallbackFunc){
        TMRConfig[id].CallbackFunc();
    }
    IFS0bits.T2IF = 0; // Clear TIMER2 interrupt flag
}
//------------------------------------------------------------------------------------------------
INTERRUPT _T3Interrupt( void )
//------------------------------------------------------------------------------------------------
{
    int id = TIMER3;
    if(TMRConfig[id].CallbackFunc){
        TMRConfig[id].CallbackFunc();
    }
    IFS0bits.T3IF = 0; // Clear TIMER3 interrupt flag
}
//------------------------------------------------------------------------------------------------
INTERRUPT _T4Interrupt( void )
//------------------------------------------------------------------------------------------------
{
    int id = TIMER4;
    if(TMRConfig[id].CallbackFunc){
        TMRConfig[id].CallbackFunc();
    }
    IFS1bits.T4IF = 0; // Clear TIMER4 interrupt flag
}
//------------------------------------------------------------------------------------------------
INTERRUPT _T5Interrupt( void )
//------------------------------------------------------------------------------------------------
{
    int id = TIMER5;
    if(TMRConfig[id].CallbackFunc){
        TMRConfig[id].CallbackFunc();
    }
    IFS1bits.T5IF = 0; // Clear TIMER5 interrupt flag
}
//------------------------------------------------------------------------------------------------
INTERRUPT _T6Interrupt( void )
//------------------------------------------------------------------------------------------------
{
    int id = TIMER6;
    if(TMRConfig[id].CallbackFunc){
        TMRConfig[id].CallbackFunc();
    }
    IFS2bits.T6IF = 0; // Clear TIMER6 interrupt flag
}
//------------------------------------------------------------------------------------------------
INTERRUPT _T7Interrupt( void )
//------------------------------------------------------------------------------------------------
{
    int id = TIMER7;
    if(TMRConfig[id].CallbackFunc){
        TMRConfig[id].CallbackFunc();
    }
    IFS3bits.T7IF = 0; // Clear TIMER7 interrupt flag
}
//------------------------------------------------------------------------------------------------
INTERRUPT _T8Interrupt( void )
//------------------------------------------------------------------------------------------------
{
    int id = TIMER8;
    if(TMRConfig[id].CallbackFunc){
        TMRConfig[id].CallbackFunc();
    }
    IFS3bits.T8IF = 0; // Clear TIMER8 interrupt flag
}
//------------------------------------------------------------------------------------------------
INTERRUPT _T9Interrupt( void )
//------------------------------------------------------------------------------------------------
{
    int id = TIMER9;
    if(TMRConfig[id].CallbackFunc){
        TMRConfig[id].CallbackFunc();
    }
    IFS3bits.T9IF = 0; // Clear TIMER9 interrupt flag
}
//************************************************************************************************
//
//                              Direct Memory Access (DMA)
//
//************************************************************************************************

