sercankuslu/astromonty/trunk/Programms/dsPIC33/TCPIP Demo App/device_control.c
// управляющие переменные
DMAConfigType DMAConfig[8];
#ifdef __C30__
    //unsigned int DMABuffer[1024]  __attribute__((space(dma)));
#if DMA0BUF_SIZE > 0
    BYTE DMA0BufferA[DMA0BUF_SIZE] __attribute__((space(dma)));
    BYTE DMA0BufferB[DMA0BUF_SIZE] __attribute__((space(dma)));
#endif
#if DMA1BUF_SIZE > 0
    BYTE DMA1BufferA[DMA1BUF_SIZE] __attribute__((space(dma)));
    BYTE DMA1BufferB[DMA1BUF_SIZE] __attribute__((space(dma)));
#endif
#if DMA2BUF_SIZE > 0
    BYTE DMA2BufferA[DMA2BUF_SIZE] __attribute__((space(dma)));
    BYTE DMA2BufferB[DMA2BUF_SIZE] __attribute__((space(dma)));
#endif
#if DMA3BUF_SIZE > 0
    BYTE DMA3BufferA[DMA3BUF_SIZE] __attribute__((space(dma)));
    BYTE DMA3BufferB[DMA3BUF_SIZE] __attribute__((space(dma)));
#endif
#if DMA4BUF_SIZE > 0
    BYTE DMA4BufferA[DMA4BUF_SIZE] __attribute__((space(dma)));
    BYTE DMA4BufferB[DMA4BUF_SIZE] __attribute__((space(dma)));
#endif
#if DMA5BUF_SIZE > 0
    BYTE DMA5BufferA[DMA5BUF_SIZE] __attribute__((space(dma)));
    BYTE DMA5BufferB[DMA5BUF_SIZE] __attribute__((space(dma)));
#endif
#if DMA6BUF_SIZE > 0
    BYTE DMA6BufferA[DMA6BUF_SIZE] __attribute__((space(dma)));
    BYTE DMA6BufferB[DMA6BUF_SIZE] __attribute__((space(dma)));
#endif
#if DMA7BUF_SIZE > 0
    BYTE DMA7BufferA[DMA7BUF_SIZE] __attribute__((space(dma)));
    BYTE DMA7BufferB[DMA7BUF_SIZE] __attribute__((space(dma)));
#endif

#else

#if DMA0BUF_SIZE > 0
    //unsigned int DMABuffer[1024];
    BYTE DMA0BufferA[DMA0BUF_SIZE];
    BYTE DMA0BufferB[DMA0BUF_SIZE];
#endif
#if DMA1BUF_SIZE > 0
    BYTE DMA1BufferA[DMA1BUF_SIZE];
    BYTE DMA1BufferB[DMA1BUF_SIZE];
#endif
#if DMA2BUF_SIZE > 0
    BYTE DMA2BufferA[DMA2BUF_SIZE];
    BYTE DMA2BufferB[DMA2BUF_SIZE];
#endif
#if DMA3BUF_SIZE > 0
    BYTE DMA3BufferA[DMA3BUF_SIZE];
    BYTE DMA3BufferB[DMA3BUF_SIZE];
#endif
#if DMA4BUF_SIZE > 0
    BYTE DMA4BufferA[DMA4BUF_SIZE];
    BYTE DMA4BufferB[DMA4BUF_SIZE];
#endif
#if DMA5BUF_SIZE > 0
    BYTE DMA5BufferA[DMA5BUF_SIZE];
    BYTE DMA5BufferB[DMA5BUF_SIZE];
#endif
#if DMA6BUF_SIZE > 0
    BYTE DMA6BufferA[DMA6BUF_SIZE];
    BYTE DMA6BufferB[DMA6BUF_SIZE];
#endif
#if DMA7BUF_SIZE > 0
    BYTE DMA7BufferA[DMA7BUF_SIZE];
    BYTE DMA7BufferB[DMA7BUF_SIZE];
#endif

#endif
static int BufferBusySize = 0;
//------------------------------------------------------------------------------------------------
WORD DMACreateConfig(DMA_DATA_SIZE_BIT size, DMA_TRANSFER_DIRECTION dir, DMA_COMPLETE_BLOCK_INT half, DMA_NULL_DATA_MODE nullw, DMA_ADRESING_MODE addr, DMA_OPERATION_MODE mode)
//------------------------------------------------------------------------------------------------
{
    WORD Config = 0;//DMACreateConfig(SIZE_BYTE, RAM_TO_DEVICE, FULL_BLOCK, NORMAL_OPS, REG_INDIRECT_W_POST_INC, ONE_SHOT
    Config |= ((WORD)size)  << 14;  // 1 
    Config |= ((WORD)dir)   << 13;  // 0
    Config |= ((WORD)half)  << 12;  // 0
    Config |= ((WORD)nullw) << 11;  // 0
    Config |= ((WORD)addr)  << 4;   // 0
    Config |= ((WORD)mode)  << 0;   // 1
    return Config;
}
//------------------------------------------------------------------------------------------------
int DMASetBuffer(DMA_ID id, BYTE* BufferA, BYTE* BufferB)
//------------------------------------------------------------------------------------------------
{
    DMAConfig[id].BufA = BufferA;
    DMAConfig[id].BufB = BufferB;
    switch(id){
        case DMA0: 
            DMA0STA = DMAOFFSET(BufferA);
            DMA0STB = DMAOFFSET(BufferB);
            break;
        case DMA1: 
            DMA1STA = DMAOFFSET(BufferA);
            DMA1STB = DMAOFFSET(BufferB);
            break;
        case DMA2: 
            DMA2STA = DMAOFFSET(BufferA);
            DMA2STB = DMAOFFSET(BufferB);
            break;
        case DMA3: 
            DMA3STA = DMAOFFSET(BufferA);
            DMA3STB = DMAOFFSET(BufferB);
            break;
        case DMA4: 
            DMA4STA = DMAOFFSET(BufferA);
            DMA4STB = DMAOFFSET(BufferB);
            break;
        case DMA5: 
            DMA5STA = DMAOFFSET(BufferA);
            DMA5STB = DMAOFFSET(BufferB);
            break;
        case DMA6: 
            DMA6STA = DMAOFFSET(BufferA);
            DMA6STB = DMAOFFSET(BufferB);
            break;
        case DMA7: 
            DMA7STA = DMAOFFSET(BufferA);
            DMA7STB = DMAOFFSET(BufferB);
            break;
        default:
            return -1;
    }
    return 0;
}
//------------------------------------------------------------------------------------------------
int DMAInit()
//------------------------------------------------------------------------------------------------
{
    BYTE i;
    for (i = DMA0; i <= DMA7; i++){
        DMAConfig[i]._This = NULL;
        DMAConfig[i].BufA = NULL;
        DMAConfig[i].BufB = NULL;
        DMAConfig[i].Count = 0;
        DMAConfig[i].fillingBufferAFunc = NULL;
        DMAConfig[i].fillingBufferBFunc = NULL;
    }

    return 0;
}
//------------------------------------------------------------------------------------------------
#define DMA0SetConfig(Config) DMA0CON = Config
#define DMA1SetConfig(Config) DMA1CON = Config
#define DMA2SetConfig(Config) DMA2CON = Config
#define DMA3SetConfig(Config) DMA3CON = Config
#define DMA4SetConfig(Config) DMA4CON = Config
#define DMA5SetConfig(Config) DMA5CON = Config
#define DMA6SetConfig(Config) DMA6CON = Config
#define DMA7SetConfig(Config) DMA7CON = Config

int DMASetConfig(DMA_ID id, WORD Config)
//------------------------------------------------------------------------------------------------
{
    switch(id){
        case DMA0: 
            DMA0CON = Config;
            break;
        case DMA1: 
            DMA1CON = Config;
            break;
        case DMA2: 
            DMA2CON = Config;
            break;
        case DMA3: 
            DMA3CON = Config;
            break;
        case DMA4: 
            DMA4CON = Config;
            break;
        case DMA5: 
            DMA5CON = Config;
            break;
        case DMA6: 
            DMA6CON = Config;
            break;
        case DMA7: 
            DMA7CON = Config;
            break;
        default:
            return -1;
    }
    return 0;
}
//------------------------------------------------------------------------------------------------
int DMASelectDevice(DMA_ID id, DMA_DEVICE_IRQ irq, int DEVICE_REG)
//------------------------------------------------------------------------------------------------
{    
    switch(id){
        case DMA0:
            DMA0REQ = (BYTE)irq;
            DMA0PAD = DEVICE_REG;
            break;
        case DMA1:
            DMA1REQ = (BYTE)irq;
            DMA1PAD = DEVICE_REG;
            break;
        case DMA2:
            DMA2REQ = (BYTE)irq;
            DMA2PAD = DEVICE_REG;
            break;
        case DMA3:
            DMA3REQ = (BYTE)irq;
            DMA3PAD = DEVICE_REG;
            break;
        case DMA4:
            DMA4REQ = (BYTE)irq;
            DMA4PAD = DEVICE_REG;
            break;
        case DMA5:
            DMA5REQ = (BYTE)irq;
            DMA5PAD = DEVICE_REG;
            break;
        case DMA6:
            DMA6REQ = (BYTE)irq;
            DMA6PAD = DEVICE_REG;
            break;
        case DMA7:
            DMA7REQ = (BYTE)irq;
            DMA7PAD = DEVICE_REG;
            break;
        default:
        return -1;
    }
    return 0;
}
#define DMA0SetDataCount(Count) DMA0CNT = Count
#define DMA1SetDataCount(Count) DMA1CNT = Count
#define DMA2SetDataCount(Count) DMA2CNT = Count
#define DMA3SetDataCount(Count) DMA3CNT = Count
#define DMA4SetDataCount(Count) DMA4CNT = Count
#define DMA5SetDataCount(Count) DMA5CNT = Count
#define DMA6SetDataCount(Count) DMA6CNT = Count
#define DMA7SetDataCount(Count) DMA7CNT = Count
//------------------------------------------------------------------------------------------------
int DMASetDataCount(DMA_ID id, WORD Count)
//------------------------------------------------------------------------------------------------
{
    DMAConfig[id].Count = Count;
    switch(id){
        case DMA0: DMA0CNT = Count-1;
            break;
        case DMA1: DMA1CNT = Count-1;
            break;
        case DMA2: DMA2CNT = Count-1;
            break;
        case DMA3: DMA3CNT = Count-1;
            break;
        case DMA4: DMA4CNT = Count-1;
            break;
        case DMA5: DMA5CNT = Count-1;
            break;
        case DMA6: DMA6CNT = Count-1;
            break;
        case DMA7: DMA7CNT = Count-1;
            break;
        default:
        return -1;
    }
    return 0;
}
//------------------------------------------------------------------------------------------------
int DMASetCallback(DMA_ID id, void* _This,  int (*fillingBufAFunc)(void*, BYTE*, WORD ), int (*fillingBufBFunc)(void*, BYTE*, WORD ))
//------------------------------------------------------------------------------------------------
{
    DMAConfig[id].fillingBufferAFunc = fillingBufAFunc;
    DMAConfig[id].fillingBufferBFunc = fillingBufBFunc; 
    DMAConfig[id]._This = _This;
    return 0;
}
//------------------------------------------------------------------------------------------------
int DMAPrepBuffer(DMA_ID id)
//------------------------------------------------------------------------------------------------
{    
    BYTE BufBEna = 0;
    if(DMAConfig[id].fillingBufferAFunc){
        DMAConfig[id].fillingBufferAFunc(DMAConfig[id]._This, (BYTE*)DMAConfig[id].BufA, DMAConfig[id].Count);
    }
    switch(id){
        case DMA0: BufBEna = DMA0CONbits.MODE & 2;
            break;
        case DMA1: BufBEna = DMA1CONbits.MODE & 2;
            break;
        case DMA2: BufBEna = DMA2CONbits.MODE & 2;
            break;
        case DMA3: BufBEna = DMA3CONbits.MODE & 2;
            break;
        case DMA4: BufBEna = DMA4CONbits.MODE & 2;
            break;
        case DMA5: BufBEna = DMA5CONbits.MODE & 2;
            break;
        case DMA6: BufBEna = DMA6CONbits.MODE & 2;
            break;
        case DMA7: BufBEna = DMA7CONbits.MODE & 2;
            break;
        default:
        return -1;
    }
    if(BufBEna && DMAConfig[id].fillingBufferBFunc){
        DMAConfig[id].fillingBufferBFunc(DMAConfig[id]._This, (BYTE*)DMAConfig[id].BufB, DMAConfig[id].Count);
    }
    return 0;
}
#define DMA0Enable  DMA0CONbits.CHEN = 1
#define DMA0Disable DMA0CONbits.CHEN = 0
#define DMA1Enable  DMA1CONbits.CHEN = 1
#define DMA1Disable DMA1CONbits.CHEN = 0
#define DMA2Enable  DMA2CONbits.CHEN = 1
#define DMA2Disable DMA2CONbits.CHEN = 0
#define DMA3Enable  DMA3CONbits.CHEN = 1
#define DMA3Disable DMA3CONbits.CHEN = 0
#define DMA4Enable  DMA4CONbits.CHEN = 1
#define DMA4Disable DMA4CONbits.CHEN = 0
#define DMA5Enable  DMA5CONbits.CHEN = 1
#define DMA5Disable DMA5CONbits.CHEN = 0
#define DMA6Enable  DMA6CONbits.CHEN = 1
#define DMA6Disable DMA6CONbits.CHEN = 0
#define DMA7Enable  DMA7CONbits.CHEN = 1
#define DMA7Disable DMA7CONbits.CHEN = 0
//------------------------------------------------------------------------------------------------
int DMAEnable(DMA_ID id)
//------------------------------------------------------------------------------------------------
{
    switch(id){
        case DMA0:
            DMA0CONbits.CHEN = 1;
            break;
        case DMA1:
            DMA1CONbits.CHEN = 1;
            break;
        case DMA2:
            DMA2CONbits.CHEN = 1;
            break;
        case DMA3:
            DMA3CONbits.CHEN = 1;
            break;
        case DMA4:
            DMA4CONbits.CHEN = 1;
            break;
        case DMA5:
            DMA5CONbits.CHEN = 1;
            break;
        case DMA6:
            DMA6CONbits.CHEN = 1;
            break;
        case DMA7:
            DMA7CONbits.CHEN = 1;
            break;
        default:
            return -1;
    }
    return 0;
}
//------------------------------------------------------------------------------------------------
int DMADisable(DMA_ID id)
//------------------------------------------------------------------------------------------------
{
    switch(id){
        case DMA0:
            DMA0CONbits.CHEN = 0;
            break;
        case DMA1:
            DMA1CONbits.CHEN = 0;
            break;
        case DMA2:
            DMA2CONbits.CHEN = 0;
            break;
        case DMA3:
            DMA3CONbits.CHEN = 0;
            break;
        case DMA4:
            DMA4CONbits.CHEN = 0;
            break;
        case DMA5:
            DMA5CONbits.CHEN = 0;
            break;
        case DMA6:
            DMA6CONbits.CHEN = 0;
            break;
        case DMA7:
            DMA7CONbits.CHEN = 0;
            break;
        default:
            return -1;
    }
    return 0;
}

