sercankuslu/astromonty/trunk/Programms/dsPIC33/TCPIP Demo App/device_control.c
//------------------------------------------------------------------------------------------------
int DMAGetPPState(DMA_ID id)
//------------------------------------------------------------------------------------------------
{
    int state = 0;
    switch(id){
        case DMA0: state = DMACS1bits.PPST0;
            break;
        case DMA1: state = DMACS1bits.PPST1;
            break;
        case DMA2: state = DMACS1bits.PPST2;
            break;
        case DMA3: state = DMACS1bits.PPST3;
            break;
        case DMA4: state = DMACS1bits.PPST4;
            break;
        case DMA5: state = DMACS1bits.PPST5;
            break;
        case DMA6: state = DMACS1bits.PPST6;
            break;
        case DMA7: state = DMACS1bits.PPST7;
            break;
        default:
        return -1;
    }
    return state;
}
//------------------------------------------------------------------------------------------------
int DMASetInt(DMA_ID id, BYTE Level, BOOL enabled)
//------------------------------------------------------------------------------------------------
{
     switch(id){
        case DMA0:
            IFS0bits.DMA0IF = 0;    // Clear the DMA interrupt flag
            IEC0bits.DMA0IE = enabled;    // Enable DMA interrupt
            IPC1bits.DMA0IP = Level;
            break;
        case DMA1:
            IFS0bits.DMA1IF = 0;    // Clear the DMA interrupt flag
            IEC0bits.DMA1IE = enabled;    // Enable DMA interrupt
            IPC3bits.DMA1IP = Level;
            break;
        case DMA2:
            IFS1bits.DMA2IF = 0;    // Clear the DMA interrupt flag
            IEC1bits.DMA2IE = enabled;    // Enable DMA interrupt
            IPC6bits.DMA2IP = Level;
            break;
        case DMA3:
            IFS2bits.DMA3IF = 0;    // Clear the DMA interrupt flag
            IEC2bits.DMA3IE = enabled;    // Enable DMA interrupt
            IPC9bits.DMA3IP = Level;
            break;
        case DMA4:
            IFS2bits.DMA4IF = 0;    // Clear the DMA interrupt flag
            IEC2bits.DMA4IE = enabled;    // Enable DMA interrupt
            IPC11bits.DMA4IP = Level;
            break;
        case DMA5:
            IFS3bits.DMA5IF = 0;    // Clear the DMA interrupt flag
            IEC3bits.DMA5IE = enabled;    // Enable DMA interrupt
            IPC15bits.DMA5IP = Level;
            break;
        case DMA6:
            IFS4bits.DMA6IF = 0;    // Clear the DMA interrupt flag
            IEC4bits.DMA6IE = enabled;    // Enable DMA interrupt
            IPC17bits.DMA6IP = Level;
            break;
        case DMA7:
            IFS4bits.DMA7IF = 0;    // Clear the DMA interrupt flag
            IEC4bits.DMA7IE = enabled;    // Enable DMA interrupt
            IPC17bits.DMA7IP = Level;
            break;
        default:
        return -1;
    }
    return 0;
}
#define DMA0ForceTransfer DMA0REQbits.FORCE = 1
#define DMA1ForceTransfer DMA1REQbits.FORCE = 1
#define DMA2ForceTransfer DMA2REQbits.FORCE = 1
#define DMA3ForceTransfer DMA3REQbits.FORCE = 1
#define DMA4ForceTransfer DMA4REQbits.FORCE = 1
#define DMA5ForceTransfer DMA5REQbits.FORCE = 1
#define DMA6ForceTransfer DMA6REQbits.FORCE = 1
#define DMA7ForceTransfer DMA7REQbits.FORCE = 1
int DMAForceTransfer(DMA_ID id)
{
    switch(id){
        case DMA0: DMA0ForceTransfer;
            break;
        case DMA1: DMA1ForceTransfer;
            break;
        case DMA2: DMA2ForceTransfer;
            break;
        case DMA3: DMA3ForceTransfer;
            break;
        case DMA4: DMA4ForceTransfer;
            break;
        case DMA5: DMA5ForceTransfer;
            break;
        case DMA6: DMA6ForceTransfer;
            break;
        case DMA7: DMA7ForceTransfer;
            break;
        default:
        return -1;
    }
    return 0;
}
//------------------------------------------------------------------------------------------------
INTERRUPT _DMA0Interrupt(void)
//------------------------------------------------------------------------------------------------
{
    DMA_ID id = DMA0;
    if(DMAConfig[id].fillingBufferAFunc){
        if(DMACS1bits.PPST0){
            DMAConfig[id].fillingBufferAFunc(DMAConfig[id]._This, (BYTE*)DMAConfig[id].BufA, DMAConfig[id].Count);
        } else {
            DMAConfig[id].fillingBufferBFunc(DMAConfig[id]._This, (BYTE*)DMAConfig[id].BufB, DMAConfig[id].Count);
        }
    }     
    IFS0bits.DMA0IF = 0; // Clear the DMA0 Interrupt Flag
}
//------------------------------------------------------------------------------------------------
INTERRUPT _DMA1Interrupt(void)
//------------------------------------------------------------------------------------------------
{    
    DMA_ID id = DMA1;
    if(DMAConfig[id].fillingBufferBFunc){
        if(DMACS1bits.PPST1){
            DMAConfig[id].fillingBufferAFunc(DMAConfig[id]._This, (BYTE*)DMAConfig[id].BufA, DMAConfig[id].Count);
        } else {
            DMAConfig[id].fillingBufferBFunc(DMAConfig[id]._This, (BYTE*)DMAConfig[id].BufB, DMAConfig[id].Count);
        }
    }
    IFS0bits.DMA1IF = 0; // Clear the DMA0 Interrupt Flag
}
//------------------------------------------------------------------------------------------------
INTERRUPT _DMA2Interrupt(void)
//------------------------------------------------------------------------------------------------
{
    DMA_ID id = DMA2;
    if(DMAConfig[id].fillingBufferAFunc){
        if(DMACS1bits.PPST2){
            DMAConfig[id].fillingBufferAFunc(DMAConfig[id]._This, (BYTE*)DMAConfig[id].BufA, DMAConfig[id].Count);
        } else {
            DMAConfig[id].fillingBufferBFunc(DMAConfig[id]._This, (BYTE*)DMAConfig[id].BufB, DMAConfig[id].Count);
        }
    }     
    IFS1bits.DMA2IF = 0; // Clear the DMA0 Interrupt Flag
}
//------------------------------------------------------------------------------------------------
INTERRUPT _DMA3Interrupt(void)
//------------------------------------------------------------------------------------------------
{    
    DMA_ID id = DMA3;
    if(DMAConfig[id].fillingBufferBFunc){
        if(DMACS1bits.PPST3){
            DMAConfig[id].fillingBufferAFunc(DMAConfig[id]._This, (BYTE*)DMAConfig[id].BufA, DMAConfig[id].Count);
        } else {
            DMAConfig[id].fillingBufferBFunc(DMAConfig[id]._This, (BYTE*)DMAConfig[id].BufB, DMAConfig[id].Count);
        }
    }
    IFS2bits.DMA3IF = 0; // Clear the DMA0 Interrupt Flag
}
//------------------------------------------------------------------------------------------------
INTERRUPT _DMA4Interrupt(void)
//------------------------------------------------------------------------------------------------
{
    DMA_ID id = DMA4;
    if(DMAConfig[id].fillingBufferAFunc){
        if(DMACS1bits.PPST4){
            DMAConfig[id].fillingBufferAFunc(DMAConfig[id]._This, (BYTE*)DMAConfig[id].BufA, DMAConfig[id].Count);
        } else {
            DMAConfig[id].fillingBufferBFunc(DMAConfig[id]._This, (BYTE*)DMAConfig[id].BufB, DMAConfig[id].Count);
        }
    }     
    IFS2bits.DMA4IF = 0; // Clear the DMA0 Interrupt Flag
}
//------------------------------------------------------------------------------------------------
INTERRUPT _Interrupt61(void)//_DMA5Interrupt(void) // ошибка в конфигурации?
//------------------------------------------------------------------------------------------------
{    
    DMA_ID id = DMA5;
    if(DMAConfig[id].fillingBufferBFunc){
        if(DMACS1bits.PPST5){
            DMAConfig[id].fillingBufferAFunc(DMAConfig[id]._This, (BYTE*)DMAConfig[id].BufA, DMAConfig[id].Count);
        } else {
            DMAConfig[id].fillingBufferBFunc(DMAConfig[id]._This, (BYTE*)DMAConfig[id].BufB, DMAConfig[id].Count);
        }
    }
    IFS3bits.DMA5IF = 0; // Clear the DMA0 Interrupt Flag
}
//------------------------------------------------------------------------------------------------
INTERRUPT _DMA6Interrupt(void)
//------------------------------------------------------------------------------------------------
{
	IFS4bits.DMA6IF = 0; // Clear the DMA0 Interrupt Flag
    DMA_ID id = DMA6;
    if(DMAConfig[id].fillingBufferAFunc){
        if(DMACS1bits.PPST6){
            DMAConfig[id].fillingBufferAFunc(DMAConfig[id]._This, (BYTE*)DMAConfig[id].BufA, DMAConfig[id].Count);
        } else {
            DMAConfig[id].fillingBufferBFunc(DMAConfig[id]._This, (BYTE*)DMAConfig[id].BufB, DMAConfig[id].Count);
        }
    }     
    //IFS4bits.DMA6IF = 0; // Clear the DMA0 Interrupt Flag
}
//------------------------------------------------------------------------------------------------
INTERRUPT _DMA7Interrupt(void)
//------------------------------------------------------------------------------------------------
{    
    DMA_ID id = DMA7;
    if(DMAConfig[id].fillingBufferBFunc){
        if(DMACS1bits.PPST7){
            DMAConfig[id].fillingBufferAFunc(DMAConfig[id]._This, (BYTE*)DMAConfig[id].BufA, DMAConfig[id].Count);
        } else {
            DMAConfig[id].fillingBufferBFunc(DMAConfig[id]._This, (BYTE*)DMAConfig[id].BufB, DMAConfig[id].Count);
        }
    }
    IFS4bits.DMA7IF = 0; // Clear the DMA0 Interrupt Flag
}
//************************************************************************************************
//
//                              Output Compare
//
//************************************************************************************************
OCConfigType OCConfig[8];
//------------------------------------------------------------------------------------------------
int OCInit(OC_ID id, SYS_IDLE idle, OC_TMR_SELECT tmr, OC_WORK_MODE ocm)
//------------------------------------------------------------------------------------------------
{
    WORD Config = 0;
    Config |= ((WORD)idle)  << 13;
    Config |= ((WORD)tmr)   << 3;
    Config |= ((WORD)ocm)   << 0;
    switch(id){
        case ID_OC1: OC1CON = Config;
            break;
        case ID_OC2: OC2CON = Config;
            break;
        case ID_OC3: OC3CON = Config;
            break;
        case ID_OC4: OC4CON = Config;
            break;
        case ID_OC5: OC5CON = Config;
            break;
        case ID_OC6: OC6CON = Config;
            break;
        case ID_OC7: OC7CON = Config;
            break;
        case ID_OC8: OC8CON = Config;
            break;
        default:
        return -1;
    }
    return 0;
}
//------------------------------------------------------------------------------------------------
int OCSetTmr(OC_ID id, OC_TMR_SELECT tmr)
//------------------------------------------------------------------------------------------------
{
    switch(id){
        case ID_OC1: OC1CONbits.OCTSEL = tmr;
            break;
        case ID_OC2: OC2CONbits.OCTSEL = tmr;
            break;
        case ID_OC3: OC3CONbits.OCTSEL = tmr;
            break;
        case ID_OC4: OC4CONbits.OCTSEL = tmr;
            break;
        case ID_OC5: OC5CONbits.OCTSEL = tmr;
            break;
        case ID_OC6: OC6CONbits.OCTSEL = tmr;
            break;
        case ID_OC7: OC7CONbits.OCTSEL = tmr;
            break;
        case ID_OC8: OC8CONbits.OCTSEL = tmr;
            break;
        default:
            return -1;
    }
    return 0;
}
//------------------------------------------------------------------------------------------------
int OCSetValue(OC_ID id, WORD ocr, WORD ocrs)
//------------------------------------------------------------------------------------------------
{
    switch(id){
        case ID_OC1:
            OC1R  = ocr;
            OC1RS = ocrs;
            break;
        case ID_OC2:
            OC2R  = ocr;
            OC2RS = ocrs;
            break;
        case ID_OC3:
            OC3R  = ocr;
            OC3RS = ocrs;
            break;
        case ID_OC4:
            OC4R  = ocr;
            OC4RS = ocrs;
            break;
        case ID_OC5:
            OC5R  = ocr;
            OC5RS = ocrs;
            break;
        case ID_OC6:
            OC6R  = ocr;
            OC6RS = ocrs;
            break;
        case ID_OC7:
            OC7R  = ocr;
            OC7RS = ocrs;
            break;
        case ID_OC8:
            OC8R  = ocr;
            OC8RS = ocrs;
            break;
        default:
        return -1;
    }
    return 0;
}
//------------------------------------------------------------------------------------------------
int OCSetInt(OC_ID id, BYTE Level, BOOL enabled)
//------------------------------------------------------------------------------------------------
{
    switch(id){
        case ID_OC1:
            IPC0bits.OC1IP = Level;
            IFS0bits.OC1IF = 0;
            IEC0bits.OC1IE = enabled;
            break;
        case ID_OC2:
            IPC1bits.OC2IP = Level;
            IFS0bits.OC2IF = 0;
            IEC0bits.OC2IE = enabled;
            break;
        case ID_OC3:
            IPC6bits.OC3IP = Level;
            IFS1bits.OC3IF = 0;
            IEC1bits.OC3IE = enabled;
            break;
        case ID_OC4:
            IPC6bits.OC4IP = Level;
            IFS1bits.OC4IF = 0;
            IEC1bits.OC4IE = enabled;
            break;
        case ID_OC5:
            IPC10bits.OC5IP = Level;
            IFS2bits.OC5IF = 0;
            IEC2bits.OC5IE = enabled;
            break;
        case ID_OC6:
            IPC10bits.OC6IP = Level;
            IFS2bits.OC6IF = 0;
            IEC2bits.OC6IE = enabled;
            break;
        case ID_OC7:
            IPC10bits.OC7IP = Level;
            IFS2bits.OC7IF = 0;
            IEC2bits.OC7IE = enabled;
            break;
        case ID_OC8:
            IPC11bits.OC8IP = Level;
            IFS2bits.OC8IF = 0;
            IEC2bits.OC8IE = enabled;
            break;
        default:
        return -1;
    }
    return 0;
}
//------------------------------------------------------------------------------------------------
int OCSetMode(OC_ID id, OC_WORK_MODE ocm)
//------------------------------------------------------------------------------------------------
{
    switch(id){
        case ID_OC1: OC1CONbits.OCM = (BYTE)ocm;
            break;
        case ID_OC2: OC2CONbits.OCM = (BYTE)ocm;
            break;
        case ID_OC3: OC3CONbits.OCM = (BYTE)ocm;
            break;
        case ID_OC4: OC4CONbits.OCM = (BYTE)ocm;
            break;
        case ID_OC5: OC5CONbits.OCM = (BYTE)ocm;
            break;
        case ID_OC6: OC6CONbits.OCM = (BYTE)ocm;
            break;
        case ID_OC7: OC7CONbits.OCM = (BYTE)ocm;
            break;
        case ID_OC8: OC8CONbits.OCM = (BYTE)ocm;
            break;
        default:
        return -1;
    }
    return 0;
}
//------------------------------------------------------------------------------------------------
int OCSetCallback(OC_ID id, int (*CallbackFunc)(void))
//------------------------------------------------------------------------------------------------
{
    OCConfig[id].CallbackFunc = CallbackFunc;
    return 0;
}
//------------------------------------------------------------------------------------------------
INTERRUPT _OC1Interrupt( void )
//------------------------------------------------------------------------------------------------
{
    int id = ID_OC1;
    if(OCConfig[id].CallbackFunc){
        OCConfig[id].CallbackFunc();
    }
    IFS0bits.OC1IF = 0; // Clear OC1 interrupt flag
}
//------------------------------------------------------------------------------------------------
INTERRUPT _OC2Interrupt( void )
//------------------------------------------------------------------------------------------------
{
    int id = ID_OC2;
    if(OCConfig[id].CallbackFunc){
        OCConfig[id].CallbackFunc();
    }
    IFS0bits.OC2IF = 0; // Clear OC2 interrupt flag
}
//------------------------------------------------------------------------------------------------
INTERRUPT _OC3Interrupt( void )
//------------------------------------------------------------------------------------------------
{
    int id = ID_OC3;
    if(OCConfig[id].CallbackFunc){
        OCConfig[id].CallbackFunc();
    }
    IFS1bits.OC3IF = 0; // Clear OC3 interrupt flag
}
//------------------------------------------------------------------------------------------------
INTERRUPT _OC4Interrupt( void )
//------------------------------------------------------------------------------------------------
{
    int id = ID_OC4;
    if(OCConfig[id].CallbackFunc){
        OCConfig[id].CallbackFunc();
    }
    IFS1bits.OC4IF = 0; // Clear OC4 interrupt flag
}
//------------------------------------------------------------------------------------------------
INTERRUPT _OC5Interrupt( void )
//------------------------------------------------------------------------------------------------
{
    int id = ID_OC5;
    if(OCConfig[id].CallbackFunc){
        OCConfig[id].CallbackFunc();
    }
    IFS2bits.OC5IF = 0; // Clear OC5 interrupt flag
}
//------------------------------------------------------------------------------------------------
INTERRUPT _OC6Interrupt( void )
//------------------------------------------------------------------------------------------------
{
    int id = ID_OC6;
    if(OCConfig[id].CallbackFunc){
        OCConfig[id].CallbackFunc();
    }
    IFS2bits.OC6IF = 0; // Clear OC6 interrupt flag
}
//------------------------------------------------------------------------------------------------
INTERRUPT _OC7Interrupt( void )
//------------------------------------------------------------------------------------------------
{
    int id = ID_OC7;
    if(OCConfig[id].CallbackFunc){
        OCConfig[id].CallbackFunc();
    }
    IFS2bits.OC7IF = 0; // Clear OC7 interrupt flag
}
//------------------------------------------------------------------------------------------------
INTERRUPT _OC8Interrupt( void )
//------------------------------------------------------------------------------------------------
{
    int id = ID_OC8;
    if(OCConfig[id].CallbackFunc){
        OCConfig[id].CallbackFunc();
    }
    IFS2bits.OC8IF = 0; // Clear OC8 interrupt flag
}
/************************************************************************************************
                                     @@@@@  @@@@@@  @@@@
                                    @@   @@  @@  @@  @@
                                    @@       @@  @@  @@
                                      @@@    @@@@@   @@
                                         @@  @@      @@
                                    @@   @@  @@      @@
                                     @@@@@  @@@@    @@@@
************************************************************************************************/
// 1. Отправка команды
// 
// 2. Отправка команды + отправка BYTE
// 3. Отправка команды + отправка WORD
// 4. Отправка команды + отправка DWORD
// 5. Отправка команды + отправка QWORD
// 6. Отправка команды + отправка BYTE* через DMA
// 7. Отправка команды + отправка WORD* через DMA
// 
// 8.  Отправка команды + получение BYTE
// 9.  Отправка команды + получение WORD
// 10. Отправка команды + получение DWORD
// 11. Отправка команды + получение QWORD
// 12. Отправка команды + получение BYTE* через DMA
// 13. Отправка команды + получение WORD* через DMA



typedef enum _Eflag
{
    SEND_DATA = 0,
    SEND_CMD,
    SEND_END,
    RECEIVE_DATA,
    RECEIVE_CONTINUE,
    RECEIVE_END,
} EFlag;

typedef struct _DEVICE_REG{
    SPI_ID id;
    SPIConfig Config;
    int (*DeviceSelect)(void);
    int (*DeviceRelease)(void);
    BYTE OldIntLevel;
} DEVICE_REG;

