sercankuslu/astromonty/trunk/Programms/dsPIC33/TCPIP Demo App/device_control.c
typedef struct _SPI_STATUS 
{
    BYTE CurrentDevice;     
    int SPIDataCount;       // количество получаемых данных
    BYTE Busy;              // флаг занятости устройства
    BYTE LastIntLevel;
    EFlag Flag;
    WORD DMASendCfg;
    WORD DMAReceiveCfg;
}SPI_STATUS;
#define MAX_SPI_DEVICES 10
DEVICE_REG SPIDeviceList[MAX_SPI_DEVICES];
static BYTE DeviceCount = 0;

volatile SPI_STATUS SPIStatus[2];
#if defined(__C30__)
static void WaitForDataReadySPI1( void )
{
    if(SPI1STATbits.SPIEN)
    while (SPI1STAT & 0x03 != 1 ){
        Nop();
        Nop();
    };
}
static void WaitForDataReadySPI2( void )
{
    if(SPI2STATbits.SPIEN)
    while (SPI2STAT & 0x03 != 1 ){
        Nop();
        Nop();
    };
}
#endif
#ifdef _WIN32
#define WaitForDataReadySPI1( void )     
#define WaitForDataReadySPI2( void )     
#endif
int SPIDMACallBack(void* _This, BYTE* DMABuff, WORD BufSize);

// блокировка SPI
void SPILock(SPI_ID id)
{
    BYTE Tmp = SRbits.IPL;
    BYTE i = 0;
    volatile SPI_STATUS* Status = &SPIStatus[id];
    while(1){
        // вход в критическую секцию
        SRbits.IPL = 4;
        if(Status->Busy){
            // выход из критической секции
            SRbits.IPL = Tmp;
        } else {
            Status->Busy = 1;
            Status->LastIntLevel = Tmp;
            break;
        }
    };
}
void SPIUnlock(SPI_ID id)
{   
    // выход из критической секции
    SRbits.IPL = SPIStatus[id].LastIntLevel;
}

void SPIRelease(SPI_ID id)
{   
    SPIStatus[id].Busy = 0;
}

BYTE SPIRegisterDevice(SPI_ID id, SPIConfig Config, int (*DeviceSelect)(void), int (*DeviceRelease)(void))
{
    DEVICE_REG* Device = &SPIDeviceList[DeviceCount];
    Device->Config.SPICON1 = Config.SPICON1;
    Device->Config.SPICON2 = Config.SPICON2;
    Device->Config.SPISTAT = Config.SPISTAT;
    Device->DeviceSelect = DeviceSelect;
    Device->DeviceRelease = DeviceRelease;
    Device->id = id;
    Device->OldIntLevel = 0;
    DeviceRelease();
    return DeviceCount++;
}

//------------------------------------------------------------------------------------------------
int SPIInit()
//------------------------------------------------------------------------------------------------
{
    BYTE SPI_id = 0;
    BYTE i = 0;
    volatile SPI_STATUS* Status;
    DEVICE_REG* Device;
    for (SPI_id = 0; SPI_id < 2; SPI_id++) {
        Status = &SPIStatus[SPI_id];
        Status->CurrentDevice = 0;
        Status->SPIDataCount = 0;
        Status->Busy = 0;
        Status->DMASendCfg    = DMACreateConfig(SIZE_BYTE, RAM_TO_DEVICE, FULL_BLOCK, NORMAL_OPS, REG_INDIRECT_W_POST_INC, ONE_SHOT);
        Status->DMAReceiveCfg = DMACreateConfig(SIZE_BYTE, DEVICE_TO_RAM, FULL_BLOCK, NORMAL_OPS, REG_INDIRECT_W_POST_INC, ONE_SHOT);
    }

    DeviceCount = 0;
    for(i = 0; i < MAX_SPI_DEVICES; i++){
        Device = &SPIDeviceList[i];
        Device->Config.SPICON1 = 0;
        Device->Config.SPICON2 = 0;
        Device->Config.SPISTAT = 0;
        Device->DeviceSelect = NULL;
        Device->DeviceRelease = NULL;
        Device->id = ID_SPI1;
        Device->OldIntLevel = 0;
    }
	// SPI2
    DMAInit(DMA3, 0);
    DMASelectDevice(DMA3, IRQ_SPI2, (int)&SPI2BUF);
    DMASetCallback(DMA3, (void*)&(SPIStatus[ID_SPI2]), SPIDMACallBack, SPIDMACallBack);
    DMASetInt(DMA3, 5, 1);

    TRISGbits.TRISG6 = 0;  // Set SCK pin as an output
    TRISGbits.TRISG7 = 1;  // Make sure SDI pin is an input
    TRISGbits.TRISG8 = 0;  // Set SDO pin as an output
    
    IPC8bits.SPI2IP = 6;
    IFS2bits.SPI2IF = 0;
    IFS2bits.SPI2EIF = 0;
    IEC2bits.SPI2IE = 1;
    IEC2bits.SPI2EIE = 0;
	// SPI1
    DMAInit(DMA2, 0);
    DMASelectDevice(DMA2, IRQ_SPI1, (int)&SPI1BUF);
    DMASetCallback(DMA2, (void*)&(SPIStatus[ID_SPI1]), SPIDMACallBack, SPIDMACallBack);
    DMASetInt(DMA2, 5, 1);

    TRISFbits.TRISF6 = 0;  // Set SCK pin as an output
    TRISFbits.TRISF7 = 1;  // Make sure SDI pin is an input
    TRISFbits.TRISF8 = 0;  // Set SDO pin as an output
    
    IPC2bits.SPI1IP = 6;
    IFS0bits.SPI1IF = 0;
    IFS0bits.SPI1EIF = 0;
    IEC0bits.SPI1IE = 1;
    IEC0bits.SPI1EIE = 0;

    return 0;
}
//------------------------------------------------------------------------------------------------
int SPIDMACallBack(void* _This, BYTE* DMABuff, WORD BufSize)
//------------------------------------------------------------------------------------------------
{
    volatile BYTE Dummy;
    SPI_STATUS* Status = (SPI_STATUS*)_This;
    BYTE DevHandle = Status->CurrentDevice;
    DEVICE_REG* Device = &SPIDeviceList[DevHandle];
    SPI_ID SPI_id = Device->id;
    switch(Status->Flag){
        case SEND_DATA:
        case SEND_CMD:
            Device->DeviceRelease();
            SPIRelease(SPI_id);
            Status->Flag = SEND_END;
            break;
        case RECEIVE_DATA:
            if(Status->SPIDataCount > 0){
                switch(SPI_id){
                    case ID_SPI1:
                        DMA2SetConfig(Status->DMAReceiveCfg);
                        DMA2SetDataCount(Status->SPIDataCount);
                        Status->Flag = RECEIVE_CONTINUE;
                        DMA2Enable;
                        DMA2ForceTransfer;
                    break;
                    case ID_SPI2:
                        DMA3SetConfig(Status->DMAReceiveCfg);
                        DMA3SetDataCount(Status->SPIDataCount);
                        Status->Flag = RECEIVE_CONTINUE;
                        DMA3Enable;
                        DMA3ForceTransfer;
                    break;
                    default: 
                    break;
                }
                break;
             }   
        case RECEIVE_CONTINUE:
            Status->Flag = RECEIVE_END;
            break;
        case SEND_END:
        case RECEIVE_END:
        default:
            break;
    }
    
