sercankuslu/astromonty/trunk/Programms/dsPIC33/TCPIP Demo App/device_control.c
    return 0;
}


//------------------------------------------------------------------------------------------------
INTERRUPT _SPI1Interrupt(void)
//------------------------------------------------------------------------------------------------
{    
    volatile BYTE Dummy;
    if(SPIStatus[ID_SPI1].Flag != RECEIVE_CONTINUE){
        Dummy = SPI1BUF;
    }
    IFS0bits.SPI1IF = 0;
}
//------------------------------------------------------------------------------------------------
INTERRUPT _SPI2Interrupt(void)
//------------------------------------------------------------------------------------------------
{   
    volatile BYTE Dummy;
    if(SPIStatus[ID_SPI2].Flag != RECEIVE_CONTINUE){
        Dummy = SPI2BUF;
    }
    IFS2bits.SPI2IF = 0;
}
//------------------------------------------------------------------------------------------------
// получение данных через SPI
// регулярная отправка без блокировок и выбора устройства
//------------------------------------------------------------------------------------------------
WORD SPI1GetArray(BYTE *val, WORD len)
//------------------------------------------------------------------------------------------------
{
    volatile BYTE Dummy;
    BYTE MODE16 = SPI1CON1bits.MODE16;
    WaitForDataReadySPI1();
    Dummy = SPI1BUF;
    if(!val) return 0;
    if(MODE16) {
        WORD_VAL wv;
        // Read the data, 2 bytes at a time, for as long as possible
        SPI1BUF = 0x0000;    // Send a dummy WORD to generate 32 clocks
        while(len >= 2) {
            WaitForDataReadySPI1();      // Wait until WORD is transmitted
            wv.Val = SPI1BUF;
            len -= 2;
            if(len >= 2)
                SPI1BUF = 0x0000;    // Send a dummy WORD to generate 32 clocks
            *(val++) = wv.v[1];
            *(val++) = wv.v[0];
        };
    }
    // Read the data
    if(len) {
        if(MODE16){
            SPI1STATbits.SPIEN = 0;
            SPI1CON1bits.MODE16 = 0;
            SPI1STATbits.SPIEN = 1;
        }
        SPI1BUF = 0x00;    // Send a dummy BYTE to generate 16 clocks
        while( len ) {
            WaitForDataReadySPI1();      // Wait until BYTE is transmitted
            *(val++) = SPI1BUF;            
            len--;
            if(len >= 1)
                SPI1BUF = 0x00;    // Send a dummy WORD to generate 32 clocks
        };
    }
    if(MODE16) {
        SPI1STATbits.SPIEN = 0;
        SPI1CON1bits.MODE16 = 1;
        SPI1STATbits.SPIEN = 1;
    }
    return len;
}//end 
//------------------------------------------------------------------------------------------------
// отправка данных по SPI
// регулярная отправка без блокировок и выбора устройства
//------------------------------------------------------------------------------------------------
WORD SPI1SendArray(BYTE *val, WORD len)
//------------------------------------------------------------------------------------------------
{    
    volatile BYTE Dummy;
    BYTE MODE16 = SPI1CON1bits.MODE16;
    if(MODE16) {
        WORD_VAL wv;
        // Send the data, 2 bytes at a time, for as long as possible
        while(len > 1) {
            wv.v[1] = *val++;
            wv.v[0] = *val++;
            len -= 2;            
            WaitForDataReadySPI1();      // Wait until WORD is transmitted
            Dummy = SPI1BUF;
            SPI1BUF = wv.Val;       // Start sending the WORD
        };
        WaitForDataReadySPI1();      // Wait until WORD is transmitted
        Dummy = SPI1BUF;
    }
    // Send the data, one byte at a time
    if(len) {
        if(MODE16){
            SPI1STATbits.SPIEN = 0;
            SPI1CON1bits.MODE16 = 0;
            SPI1STATbits.SPIEN = 1;
        }
        while(len) {
            len--;                  
            WaitForDataReadySPI1();      // Wait until byte is transmitted
            Dummy = SPI1BUF;
            SPI1BUF = *val++;       // Start sending the byte
        };
        WaitForDataReadySPI1();      // Wait until WORD is transmitted
        Dummy = SPI1BUF;
    }
    if(MODE16) {
        SPI1STATbits.SPIEN = 0;
        SPI1CON1bits.MODE16 = 1;
        SPI1STATbits.SPIEN = 1;
    }
    return len;
}

SPIConfig SPI_CreateParams( SPI_MODE Mode, SPI_CLOCK_MODE ClockMode, DWORD DeviceSpeed,SYS_IDLE Idle,SPI_DATA_SIZE_BIT DataSize, SPI_INPUT_PHASE InputPhase)
{
    SPIConfig Config;
    Config.SPISTAT = 0;
    Config.SPISTAT |= ((WORD)Idle) << 13;
    Config.SPICON1 = 0;
    Config.SPICON1 |= ((WORD)Mode) << 5;
    Config.SPICON1 |= ((WORD)ClockMode & 1) << 6;
    Config.SPICON1 |= ((WORD)ClockMode & 2) << 8;
    Config.SPICON1 |= ((WORD)InputPhase) << 9;
    Config.SPICON1 |= ((WORD)DataSize) << 10;
    Config.SPICON1 |= 0x1E;
    return Config;
}
//________________________________________________________________________________________________
// 
// передача данных с помощью DMA
// 1. Определить порт SPI
// 2. Блокирование прерываний уровня порта SPI
// 3. Проверка счетчика SPIxDataCount. Ожидание, если не 0
// 4. настройка порта SPI
// 5. инициализация DMA (передача функций Select и Release и т.д.)
// 6. запуск передачи
// 7. ожидание передачи всех данных в буфер DMA
// 8. снятие блокировки прерывания выполняется счетчиком SPIxDataCounter()
// 9. выход.

WORD SPISendData( BYTE DeviceHandle, BYTE* Cmd, WORD CmdLen, BYTE* Data, WORD DataLen )
{
    // TODO: проверка DeviceHandle
    // 1. Определить порт SPI
    DEVICE_REG* Device = &SPIDeviceList[DeviceHandle];
    SPI_ID SPI_id = Device->id;
    WORD DataSent = 0;
    volatile SPI_STATUS* Status;
    
    // TODO: проверка размеров
    // Захват шины SPI
    SPILock(SPI_id);
    Status = &SPIStatus[SPI_id];
    Status->CurrentDevice = DeviceHandle;
    Status->Flag = SEND_DATA;
    switch(SPI_id){
        case ID_SPI1:
            SPI1STATbits.SPIEN = 0;
            SPI1CON1 = Device->Config.SPICON1;
            SPI1CON2 = Device->Config.SPICON2;
            SPI1STAT = Device->Config.SPISTAT;
            // буфер для отправки
            DMA2Disable;
            DMA2SetConfig(Status->DMASendCfg);
            DMA2SetDataCount(CmdLen + DataLen);
            // буфер для приёма
            DMA3Disable;
            DMA3SetConfig(Status->DMAReceiveCfg);
            DMA3SetDataCount(CmdLen + DataLen);
            memcpy(DMA2BufferA, Cmd, CmdLen);
            memcpy(&DMA2BufferA[CmdLen], Data, DataLen);
            DMA2BufferA[CmdLen] = 0;
            IFS0bits.SPI1IF = 0;
            IFS0bits.SPI1EIF = 0;
            SPI1STATbits.SPIEN = 1;
            Device->DeviceSelect();
            DMA2Enable;
            DMA3Enable;
            DMA2ForceTransfer;
            break;
        case ID_SPI2:
            SPI2STATbits.SPIEN = 0;
            SPI2CON1 = Device->Config.SPICON1;
            SPI2CON2 = Device->Config.SPICON2;            
            SPI2STAT = Device->Config.SPISTAT;
            DMA3Disable;
            DMA3SetConfig(Status->DMASendCfg);
            DMA3SetDataCount(CmdLen + DataLen);
            memcpy(DMA3BufferA, Cmd, CmdLen);
            memcpy(&DMA3BufferA[CmdLen], Data, DataLen);
            DMA3BufferA[CmdLen] = 0;
            IFS2bits.SPI2IF = 0;
            IFS2bits.SPI2EIF = 0;
            SPI2STATbits.SPIEN = 1;
            Device->DeviceSelect();
            DMA3Enable;
            DMA3ForceTransfer;
            break;
        default:
            SPIRelease(SPI_id);
            SPIUnlock(SPI_id);
            return 0 ;
    }
    SPIUnlock(SPI_id);
    return DataLen;
}
WORD SPIReceiveData( BYTE DeviceHandle, BYTE* Cmd, WORD CmdLen, BYTE* Data, WORD DataLen )
{
    // TODO: проверка DeviceHandle
    // 1. Определить порт SPI
    SPI_ID SPI_id = SPIDeviceList[DeviceHandle].id;
    WORD DataSent = 0;
    volatile EFlag TFlag;
    // TODO: проверка размеров
    // Захват шины SPI
    SPILock(SPI_id);
    SPIStatus[SPI_id].CurrentDevice = DeviceHandle;
    SPIStatus[SPI_id].Flag = RECEIVE_DATA;
    SPIStatus[SPI_id].SPIDataCount = DataLen;
    switch(SPI_id){
        case ID_SPI1:
            SPI1STATbits.SPIEN = 0;
            SPI1CON1 = SPIDeviceList[DeviceHandle].Config.SPICON1;
            SPI1CON2 = SPIDeviceList[DeviceHandle].Config.SPICON2;            
            SPI1STAT = SPIDeviceList[DeviceHandle].Config.SPISTAT;
            DMAEnable(DMA7, 0, 0);
            DMASetConfig(DMA7, SPIStatus[SPI_id].DMASendCfg);
            DMASetDataCount(DMA7, CmdLen + 1);
            memcpy(DMA7BufferA, Cmd, CmdLen);
            DMA7BufferA[CmdLen] = 0;
            IFS0bits.SPI1IF = 0;
            IFS0bits.SPI1EIF = 0;
            SPI1STATbits.SPIEN = 1;
            SPIDeviceList[DeviceHandle].DeviceSelect();
            DMAEnable(DMA7, 1, 1);
            while(SPIStatus[ID_SPI1].Flag != RECEIVE_END){
                Nop();
                Nop();
            }
            WaitForDataReadySPI1();
            SPIDeviceList[DeviceHandle].DeviceRelease();
            memcpy(Data, DMA7BufferA, DataLen);
            SPIRelease(ID_SPI1);
            break;
        case ID_SPI2:
            SPI2STATbits.SPIEN = 0;
            SPI2CON1 = SPIDeviceList[DeviceHandle].Config.SPICON1;
            SPI2CON2 = SPIDeviceList[DeviceHandle].Config.SPICON2;
            SPI2STAT = SPIDeviceList[DeviceHandle].Config.SPISTAT;
            DMAEnable(DMA6, 0, 0);
            DMASetConfig(DMA6, SPIStatus[SPI_id].DMASendCfg);
            DMASetDataCount(DMA6, CmdLen + 1);
            memcpy(DMA6BufferA, Cmd, CmdLen);
            DMA6BufferA[CmdLen] = 0;
            IFS2bits.SPI2IF = 0;
            IFS2bits.SPI2EIF = 0;
            SPI2STATbits.SPIEN = 1;
            SPIDeviceList[DeviceHandle].DeviceSelect();
            DMAEnable(DMA6, 1, 1);
            while(SPIStatus[ID_SPI2].Flag != RECEIVE_END){
                Nop();
                Nop();
            }
            WaitForDataReadySPI2();
            SPIDeviceList[DeviceHandle].DeviceRelease();
            memcpy(Data, DMA6BufferA, DataLen);
            SPIRelease(ID_SPI2);
            break;
        default:
            SPIRelease(SPI_id);
            SPIUnlock(SPI_id);
        	return 0;
    }
	SPIUnlock(SPI_id);
    return DataLen;
}
WORD SPISendCmd( BYTE DeviceHandle, BYTE* Cmd, WORD CmdLen)
{
    // TODO: проверка DeviceHandle
    // 1. Определить порт SPI
    SPI_ID SPI_id = SPIDeviceList[DeviceHandle].id;
    WORD DataSent = 0;
    // TODO: проверка размеров
    // Захват шины SPI
    SPILock(SPI_id);
    SPIStatus[SPI_id].CurrentDevice = DeviceHandle;
    SPIStatus[SPI_id].Flag = SEND_CMD;
    SPIStatus[SPI_id].SPIDataCount = 0;
    switch(SPI_id){
        case ID_SPI1:
            SPI1STATbits.SPIEN = 0;
            SPI1CON1 = SPIDeviceList[DeviceHandle].Config.SPICON1;
            SPI1STAT = SPIDeviceList[DeviceHandle].Config.SPISTAT;
            DMAEnable(DMA7, 0, 0);
            DMASetConfig(DMA7, SPIStatus[SPI_id].DMASendCfg);
            DMASetDataCount(DMA7, CmdLen);
            memcpy(DMA7BufferA, Cmd, CmdLen);
            DMA7BufferA[CmdLen] = 0;
            IFS0bits.SPI1IF = 0;
            IFS0bits.SPI1EIF = 0;
            SPI1STATbits.SPIEN = 1;
            SPIDeviceList[DeviceHandle].DeviceSelect();
            DMAEnable(DMA7, 1, 1);
            break;
        case ID_SPI2:
            SPI2STATbits.SPIEN = 0;
            SPI2CON1 = SPIDeviceList[DeviceHandle].Config.SPICON1;
            SPI2STAT = SPIDeviceList[DeviceHandle].Config.SPISTAT;
            DMAEnable(DMA6, 0, 0);
            DMASetConfig(DMA6, SPIStatus[SPI_id].DMASendCfg);
            DMASetDataCount(DMA6, CmdLen);
            memcpy(DMA6BufferA, Cmd, CmdLen);
            DMA6BufferA[CmdLen] = 0;
            IFS2bits.SPI2IF = 0;
            IFS2bits.SPI2EIF = 0;
            SPI2STATbits.SPIEN = 1;
            SPIDeviceList[DeviceHandle].DeviceSelect();
            DMAEnable(DMA6, 1, 1);
            break;
        default:
            SPIRelease(SPI_id);            
    }
    SPIUnlock(SPI_id);
    return 0;
}

